Autodesk.Revit.DB.Form.ConstrainProfiles(System.Int32)
Constrain form profiles using the specified profile as primary. This is an advanced version of property "AreProfilesConstrained", allowing specify the primary profile.
primaryProfileIndex: Index to specify the profile used as primary profile.
If "primaryProfileIndex" is less than zero, the form will become unconstrained, it has the same effect as "AreProfilesConstrained = false".
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This operation can only be performed on a swept blend form.

Autodesk.Revit.DB.Form.AreProfilesConstrained
Get/set if the form's profiles are constrained.
There is another method "constrainProfile" to constrain profile using certain profile as the primary one.
If this property is used to constrain the form, the first profile will be automatically selected as primary profile.
When form profiles are constrained, changing one profile also changes all other profiles at the same time.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property to 'true'
This operation can only be performed on a swept blend form.